{
  //Database connections: Use one of the entries below. LocalDB is set as the default to enable minimum configuration required to start working with the server.

  //LocalDB: A self-contained SQL Server without any configuration or external connectivity.
  "DbMode": "LocalDB",
  "DbConnectionString": "Server=(localdb)\\Praxis;Integrated Security=true;",

  //Micosoft SQL Server: Well supported commercial database option. Eats a LOT of disk space, particularly on logging.
  //"DbMode": "SQLServer",
  //"DbConnectionString": "Server=localhost\\SQLEXPRESS2022;database=praxis;User Id=praxis;Password=test;trustServerCertificate=true",

  //MariaDB: Free and open-source database. Simpler than SQL Server, but has all the necessary features for PraxisMapper. Suggested for most users that need more than LocalDB.
  //"DbMode": "MariaDB",
  //"DbConnectionString": "server=localhost;database=praxis;user=root;password=test;",

  ///The folder to read PBF and PMD files from. Also where any output files will be generated.
  "PbfFolder": "C:\\Praxis\\",

  //If true, Larry ignores the PraxisMapper database and uses only the default styles. False reads all styles present in the database.
  "ForceStyleDefaults": false,
  //If false, will save directly to DB. If true, saves processed output to a .pmd file in the PbfFolder instead.
  "WritePmdFiles": false,
  //Set this to limit PBF importing to entries that intersect or are overlapped by a relation with this ID. 0 means all entries in the PBF will be processed.
  "UseOneRelationID": 0,
  //How much verbosity to use in console or text-file logging. 1 = None, 2 is Errors Only, 3 is Normal, 4 is Verbose.
  "LogLevel": 3,
  //Set this to true ONLY if you are using the -drawOneImage:#### command, and want to draw the output from a PBF file without actually loading the data to a database.
  "KeepElementsInMemory": false,
  //When processing PBFs, use this style set to decide if an area if 'unmatched' or not
  "TagParserStyleSet": "importAll",
  //How much to multiply the size of a gameplay map tile by. At 1, Cell8 sized plus code images are 80x100, making each pixel a single Cell11. Defaults to 4, for 320x400px tiles.
  "mapTileScaleFactor": 4,
  //How large to render Slippy tiles (Google Maps or Leaflet type viewers, that 'slip' around as you drag the mouse). Usually 256 or 512. PraxisSlippy plugin expects 512.
  "slippyTileSize": 512, //is in db settings already.
  //How much additional area to load when drawing map tiles. Necessary to have points on the edge of a map tile draw correctly. Defaults to a single Cell10 width.
  "AreaBuffer": 0.000125,
  //normal: Intended functionality. Use data as it is.
  //expandPoints: Takes any Node entries in the reprocessed file, and converts them to a Cell8-sized Way.
  //center: save only item's center point, instead of it's full data. 
  //minimize: Saves a reduced-accuracy version of elements that uses fewer points. Looks fine zoomed out, tends to be very inaccurate up close.
  //If you are EXTREMELY limited on space, and not drawing map tiles to be served, but want to detect what areas a user is present at, minimize might be the option you want.
  //offline: Loads places to the OfflinePlace table, which ignores all tags and PlaceData items in favor of storing the name and matched style entry inline.
  //offline should be used if you're not going to update the data or are making offline files for a client app.
  "processingMode": "normal",
  //When creating images, load this IMapTiles interface to do it. Valid options are "SkiaSharp" and "ImageSharp".
  //SkiaSharp is faster and generally looks better, but only works on Windows because of native dependencies. ImageSharp works on everything, but about 30% of the speed.
  "MapTilesEngine": "SkiaSharp",
  // normal: multithreading, conserve RAM betwen blocks. low: singlethread, conserve RAM, high: multithread, keep all read blocks in RAM. Don't use 'high' unless you are working on a very small area.
  // On extremely problematic geometries, normal mode will attempt to drop into low mode for a single block instead of quitting on an error.
  "ResourceUse": "normal",

  //Configuration values for making Offline JSON files. The default create data that can be drawn with 1 Cell11 as 1 pixel, and geometry simplified to remove points that 
  //wouldn't make a significant difference on the output. These numbers can be made smaller (ideally to Cell12 resolution values) if higher accuracy is required.
  //For Cell8 game tiles they are the following sizes at x1 scale:
  //Cell10 resolution: 20x20,  1.0 aspect ratio .000125
  //Cell11 resolution: 80x100 - the original default, .8 aspect ratio, what the current client setup is intended to handle.
  //Cell12 resolution: 320x500 - .64 aspect ratio, expected new default, would require spacing adjustments in the demo client.
  "offlineSimplifyResolution": ".0000078125", //0 to disable simplification. .000025 for Cell1 resolution, 0.0000078125 for Cell12 resolution
  "offlineXPixelResolution": ".0000078125", // .00003125 for Cell1 resolution, .0000078125 for Cell12 resolution
  "offlineYPixelResolution": ".000005", //.000025 for Cell1 resolution, .000005 for Cell12 resolution
 
}
